src/CF/InformationRegisters/ЗначенияДополнительныхРеквизитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияДополнительныхРеквизитов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеРеквизита</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектВладелец</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДополнительныйРеквизит</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеРеквизиты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CF/Enums/ТипыДополнительныхРеквизитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>ТипыДополнительныхРеквизитов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Строка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Число</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Булево</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СсылкаНаЭлементСправочника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СсылкаНаДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗначениеИзСправочника</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CF/InformationRegisters/ЗначенияДополнительныхРеквизитов/Forms/ФормаЗаписи/Ext/Form/Module.bsl
// sza140831-0334 : 
// sza140106-2319 : 
&НаКлиенте
Процедура НачалоГодаК(Команда)
	запись.Период = НачалоГода(ОбщийМодульСервисСервер.ПользователяТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура НачалоМесяцаК(Команда)
	запись.Период = НачалоМесяца(ОбщийМодульСервисСервер.ПользователяТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1, Запись.Ответственный, ИСТИНА);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0, Запись.Ответственный, ИСТИНА);
	ОбновитьВидимостьКнопок();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
		ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.ДополнительныйРеквизит)
		И НЕ Запись.ДополнительныйРеквизит.Периодический Тогда
		
		Элементы.ГруппаПериода.Видимость = ЛОЖЬ;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Запись.ОбъектВладелец) Тогда
		Элементы.ОбъектВладелец.ТолькоПросмотр = ЛОЖЬ;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сегодня(Команда)
	запись.Период = ОбщийМодульСервисСервер.ПользователяТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныйРеквизитПриИзменении(Элемент)
	ОбновитьВидимостьКнопок();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьКнопок()
	
	Если ЗначениеЗаполнено(Запись.ДополнительныйРеквизит) Тогда		
		ТипДополнительногоРеквизита = ОбщийМодульКлиент.получитьЗначениеРеквизита(Запись.ДополнительныйРеквизит, "ТипДополнительногоРеквизита");
		
		Если ТипДополнительногоРеквизита = ПредопределенноеЗначение("Перечисление.ТипыДополнительныхРеквизитов.ЗначениеИзСправочника")
			ИЛИ ТипДополнительногоРеквизита = ПредопределенноеЗначение("Перечисление.ТипыДополнительныхРеквизитов.СсылкаНаЭлементСправочника")
			ИЛИ ТипДополнительногоРеквизита = ПредопределенноеЗначение("Перечисление.ТипыДополнительныхРеквизитов.СсылкаНаДокумент") Тогда
			
			Элементы.ЗначениеРеквизита.КнопкаВыбора  = ИСТИНА;
			Элементы.ЗначениеРеквизита.КнопкаОчистки = ИСТИНА;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеРеквизитаОчистка(Элемент, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Запись.ДополнительныйРеквизит) Тогда
		ТипДополнительногоРеквизита = ОбщийМодульКлиент.получитьЗначениеРеквизита(Запись.ДополнительныйРеквизит, "ТипДополнительногоРеквизита");
		
		Если ТипДополнительногоРеквизита = ПредопределенноеЗначение("Перечисление.ТипыДополнительныхРеквизитов.СсылкаНаЭлементСправочника")
			ИЛИ ТипДополнительногоРеквизита = ПредопределенноеЗначение("Перечисление.ТипыДополнительныхРеквизитов.СсылкаНаДокумент") Тогда
			СтандартнаяОбработка = ЛОЖЬ;
			
			Запись.ЗначениеРеквизита = Неопределено;		
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеРеквизитаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Запись.ДополнительныйРеквизит) Тогда
		
		ТипДополнительногоРеквизита = ОбщийМодульКлиент.получитьЗначениеРеквизита(Запись.ДополнительныйРеквизит, "ТипДополнительногоРеквизита");
		Если ТипДополнительногоРеквизита = ПредопределенноеЗначение("Перечисление.ТипыДополнительныхРеквизитов.СсылкаНаЭлементСправочника") Тогда
			СтандартнаяОбработка = ЛОЖЬ;
			
			Если Запись.ЗначениеРеквизита = Неопределено Тогда
				ТипРеквизита = Неопределено;

				ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ЗначениеРеквизитаНачалоВыбораЗавершение3", ЭтаФорма, Новый Структура("ТипДополнительногоРеквизита", ТипДополнительногоРеквизита)), ОбщийМодульКлиент.ПолучитьСписокИзМетаданных(ИСТИНА));
                Возврат;
			КонецЕсли;
			ЗначениеРеквизитаНачалоВыбораФрагмент1();

			
		ИначеЕсли ТипДополнительногоРеквизита = ПредопределенноеЗначение("Перечисление.ТипыДополнительныхРеквизитов.СсылкаНаДокумент") Тогда
			СтандартнаяОбработка = ЛОЖЬ;
			
			Если Запись.ЗначениеРеквизита = Неопределено Тогда
				ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ЗначениеРеквизитаНачалоВыбораЗавершение1", ЭтаФорма, Новый Структура("ТипДополнительногоРеквизита", ТипДополнительногоРеквизита)), ОбщийМодульКлиент.ПолучитьСписокИзМетаданных(ЛОЖЬ));
                Возврат;
			КонецЕсли;
			ЗначениеРеквизитаНачалоВыбораФрагмент();

			
		ИначеЕсли ТипДополнительногоРеквизита = ПредопределенноеЗначение("Перечисление.ТипыДополнительныхРеквизитов.ЗначениеИзСправочника") Тогда
			СтандартнаяОбработка = ЛОЖЬ;
		
			Запись.ЗначениеРеквизита = ПредопределенноеЗначение("Справочник.НаборЗначенийДополнительныхРеквизитов.ПустаяСсылка");
			ПараметрыФормы = Новый Структура("Владелец", Запись.ДополнительныйРеквизит);
			ФормаВыбора = ПолучитьФорму("Справочник.НаборЗначенийДополнительныхРеквизитов.Форма.ФормаВыбора", ПараметрыФормы, ЭтаФорма);
			ФормаВыбора.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите значение") + ":";
			Запись.ЗначениеРеквизита = ФормаВыбора.ОткрытьМодально();
		
		КонецЕсли; 	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеРеквизитаНачалоВыбораЗавершение3(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	ТипДополнительногоРеквизита = ДополнительныеПараметры.ТипДополнительногоРеквизита;	
	
	ТипРеквизита = ВыбранныйЭлемент;
	Если НЕ ТипРеквизита = Неопределено Тогда
		Запись.ЗначениеРеквизита = ПредопределенноеЗначение("Справочник." + ТипРеквизита.Значение + ".ПустаяСсылка");	
	КонецЕсли;
	
	ЗначениеРеквизитаНачалоВыбораФрагмент1();

КонецПроцедуры

&НаКлиенте
Процедура ЗначениеРеквизитаНачалоВыбораФрагмент1()
	
	ПоказатьВводЗначения(Новый ОписаниеОповещения("ЗначениеРеквизитаНачалоВыбораЗавершение2", ЭтаФорма, Новый Структура("Запись", Запись)), Запись.ЗначениеРеквизита, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите значение") + ":");

КонецПроцедуры

&НаКлиенте
Процедура ЗначениеРеквизитаНачалоВыбораЗавершение2(Значение, ДополнительныеПараметры) Экспорт
	
	Запись = ?(Значение = Неопределено, ДополнительныеПараметры.Запись, Значение);

КонецПроцедуры

&НаКлиенте
Процедура ЗначениеРеквизитаНачалоВыбораЗавершение1(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	ТипДополнительногоРеквизита = ДополнительныеПараметры.ТипДополнительногоРеквизита;	
	
	ТипРеквизита = ВыбранныйЭлемент;
	Если НЕ ТипРеквизита = Неопределено Тогда
		Запись.ЗначениеРеквизита = ПредопределенноеЗначение("Документ." + ТипРеквизита.Значение + ".ПустаяСсылка");	
	КонецЕсли;
	
	ЗначениеРеквизитаНачалоВыбораФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ЗначениеРеквизитаНачалоВыбораФрагмент()
	
	ПоказатьВводЗначения(Новый ОписаниеОповещения("ЗначениеРеквизитаНачалоВыбораЗавершение", ЭтаФорма, Новый Структура("Запись", Запись)), Запись.ЗначениеРеквизита, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите значение") + ":");

КонецПроцедуры

&НаКлиенте
Процедура ЗначениеРеквизитаНачалоВыбораЗавершение(Значение, ДополнительныеПараметры) Экспорт
	
	Запись = ?(Значение = Неопределено, ДополнительныеПараметры.Запись, Значение);
	
КонецПроцедуры
